STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_SerialPort_CentralPeripheral/STM32_BLE/App/gatt_client_app.c
  for (index = 0 ; index < GATT_CLT_MAX_NUM_SERVERS ; index++)
  {
    if (a_ClientContext[index].connHdl == p_evt->Connection_Handle)
    {
      break;
    }
  }

  if (a_ClientContext[index].connHdl == p_evt->Connection_Handle)
  {
    /* event data in Attribute_Data_List contains:
    * 2 bytes handle
    * 2 or 16 bytes data for UUID
    */
    if (p_evt->Format == UUID_TYPE_16)
    {
      uuid_size = 2;
      uuid_offset = 2;
      uuid_short_offset = 0;
      handle_uuid_pair_size = 4;
    }
    if (p_evt->Format == UUID_TYPE_128)
    {
      uuid_size = 16;
      uuid_offset = 2;
      uuid_short_offset = 12;
      handle_uuid_pair_size = 18;
    }
    UNUSED(uuid_size);

    /* Number of handle uuid pairs */
    numDesc = (p_evt->Event_Data_Length) / handle_uuid_pair_size;

    for (i = 0; i < numDesc; i++)
    {
      handle = UNPACK_2_BYTE_PARAMETER(&p_evt->Handle_UUID_Pair[uuid_offset - 2]);
      uuid = UNPACK_2_BYTE_PARAMETER(&p_evt->Handle_UUID_Pair[uuid_offset + uuid_short_offset]);

      if (uuid == PRIMARY_SERVICE_UUID)
      {
        APP_DBG_MSG("PRIMARY_SERVICE_UUID=0x%04X handle=0x%04X\n", uuid, handle);
      }
      else if (uuid == CHARACTERISTIC_UUID)
      {
        /* reset UUID & handle */
        gattCharStartHdl = 0;
        gattCharValueHdl = 0;

        gattCharStartHdl = handle;
        APP_DBG_MSG("reset - UUID & handle - CHARACTERISTIC_UUID=0x%04X CharStartHandle=0x%04X\n", uuid, handle);
      }
      else if ( (uuid == CHAR_EXTENDED_PROPERTIES_DESCRIPTOR_UUID)
             || (uuid == CLIENT_CHAR_CONFIG_DESCRIPTOR_UUID) )
      {

        APP_DBG_MSG("Descriptor UUID=0x%04X, handle=0x%04X-0x%04X-0x%04X",
                      uuid,
                      gattCharStartHdl,
                      gattCharValueHdl,
                      handle);
        if (a_ClientContext[index].ServiceChangedCharValueHdl == gattCharValueHdl)
        {
          a_ClientContext[index].ServiceChangedCharDescHdl = handle;
          APP_DBG_MSG(", Service Changed found\n");
        }
/* USER CODE BEGIN gatt_parse_descs_1 */
        else if (a_ClientContext[index].SerialPortWriteToServerValueHdl == gattCharValueHdl)
        {
          UNUSED(gattCharStartHdl);
          a_ClientContext[index].SerialPortWriteToServerDescHdl = handle;
          APP_DBG_MSG(", SerialPortWrite found : Desc UUID=0x%04X handle=0x%04X-0x%04X-0x%04X\n",
                      uuid, gattCharStartHdl, gattCharValueHdl, handle);
        }
        else if (a_ClientContext[index].SerialPortNotificationValueHdl == gattCharValueHdl)
        {
          UNUSED(gattCharStartHdl);
          a_ClientContext[index].SerialPortNotificationDescHdl = handle;
          APP_DBG_MSG(", SerialPortNotification found : Desc UUID=0x%04X handle=0x%04X-0x%04X-0x%04X\n",
                      uuid, gattCharStartHdl, gattCharValueHdl, handle);
        }
/* USER CODE END gatt_parse_descs_1 */
        else
        {
          APP_DBG_MSG("\n");
        }
      }
      else
      {
        gattCharValueHdl = handle;

        APP_DBG_MSG("  UUID=0x%04X, handle=0x%04X", uuid, handle);

        if (uuid == DEVICE_NAME_UUID)
        {
          APP_DBG_MSG(", found GAP DEVICE_NAME_UUID\n");
        }
        else if (uuid == APPEARANCE_UUID)
        {
          APP_DBG_MSG(", found GAP APPEARANCE_UUID\n");
        }
        else if (uuid == SERVICE_CHANGED_UUID)
        {
          APP_DBG_MSG(", found GATT SERVICE_CHANGED_CHARACTERISTIC_UUID\n");
        }
/* USER CODE BEGIN gatt_parse_descs_2 */
        else if (uuid == TX_UUID__SHORT)
        {
          APP_DBG_MSG(", found TX_CHR_UUID\n");
        }
        else if (uuid == RX_UUID__SHORT)
        {
          APP_DBG_MSG(", found RX_CHR_UUID\n");
        }
/* USER CODE END gatt_parse_descs_2 */
        else
        {
          APP_DBG_MSG("\n");
        }
      }
    uuid_offset += handle_uuid_pair_size;
    }
  }
  else
  {
    APP_DBG_MSG("ACI_ATT_FIND_INFO_RESP_VSEVT_CODE, failed handle not found in connection table !\n");
  }

  return;
}

static void gatt_parse_notification(aci_gatt_clt_notification_event_rp0 *p_evt)
{
  APP_DBG_MSG("ACI_GATT_NOTIFICATION_VSEVT_CODE - ConnHdl=0x%04X, Attribute_Handle=0x%04X\n",
              p_evt->Connection_Handle,
              p_evt->Attribute_Handle);
/* USER CODE BEGIN gatt_parse_notification_1 */
  uint16_t attr_handle;
  APP_DBG_MSG("gatt_parse_notification\n");

  attr_handle = p_evt->Attribute_Handle;
  if(attr_handle == tx_handle+1)
  {
    for(int i = 0; i < p_evt->Attribute_Value_Length; i++) 
        printf("%c", p_evt->Attribute_Value[i]);
  }
  else
  {
      printf("Received data from not recognized attribute handle 0x%4X\n", p_evt->Attribute_Handle);
  }
/* USER CODE END gatt_parse_notification_1 */

  return;
}

static void client_discover_all(void)
{
  GATT_CLIENT_APP_Discover_services(0);
  return;
}

static void gatt_cmd_resp_release(void)
{
  UTIL_SEQ_SetEvt(1U << CFG_IDLEEVT_PROC_GATT_COMPLETE);
  return;
}

static void gatt_cmd_resp_wait(void)
{
  UTIL_SEQ_WaitEvt(1U << CFG_IDLEEVT_PROC_GATT_COMPLETE);
  return;
}

/* USER CODE BEGIN LF */

void SerialPort_Client_Write_Char__set_params(uint8_t* i_a_buffSpTx, uint8_t i_buffSpTxLen)
{
  buffSpTxLen = i_buffSpTxLen;
  memcpy(&a_buffSpTx[0], &i_a_buffSpTx[0], i_buffSpTxLen);
}

static void SerialPort_Client_Write_Char(void)


{
  uint8_t index = 0;
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;

  for(index = 0; index < GATT_CLT_MAX_NUM_SERVERS; index++)
  {
    if (a_ClientContext[index].state != GATT_CLIENT_APP_IDLE)
    {
      ret = aci_gatt_clt_write_without_resp(a_ClientContext[index].connHdl,
                                            BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                                            a_ClientContext[index].SerialPortWriteToServerValueHdl,
                                            buffSpTxLen,
                                            (uint8_t *)&a_buffSpTx);

      if (ret != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("aci_gatt_clt_write_without_resp failed, connHdl=0x%04X, ValueHdl=0x%04X\n",
                    a_ClientContext[index].connHdl,
                    a_ClientContext[index].SerialPortWriteToServerValueHdl);
      }
    }
  }

  return;
}

/* USER CODE END LF */
